#### importing the necessary libraries

In [2]:
import numpy as np
import pandas as pd
df=pd.read_csv('Salary_Data.csv')

In [3]:
pd.set_option('display.float_format','{:.2f}'.format)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6705 entries, 0 to 6704
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Age                  6703 non-null   float64
 1   Gender               6702 non-null   object
 2   Education Level      6700 non-null   object
 3   Job Title            6701 non-null   object
 4   Years of Experience  6700 non-null   float64
 5   Salary               6698 non-null   float64
dtypes: float64(3), object(3)
memory usage: 314.4+ KB

In [31]:
df.head()

,Age,Gender,Education_Level,Job_Title,Experience,Salary
1,28.00,Female,Master's Degree,Data Analyst,3.00,65000.00
4,52.00,Male,Master's Degree,Director,20.00,200000.00
7,31.00,Male,Bachelor's Degree,FullStack Developer,4.00,80000.00
8,26.00,Female,Bachelor's Degree,Marketing Coordinator,1.00,45000.00
9,38.00,Male,PhD,Senior Scientist,10.00,110000.00

#### rename the columns

In [5]:
df.rename(columns={'Education Level':'Education_Level',"Job Title":'Job_Title','Years of Experience':'Experience'},inplace=True)

#### Handling unconsistent education levels

In [6]:
df.Education_Level.value_counts()
df.loc[ (df.Education_Level=="Bachelor's"),'Education_Level']="Bachelor's Degree"
df.loc[ (df.Education_Level=="Master's"),'Education_Level']="Master's Degree"
df.loc[ (df.Education_Level=="phD"),'Education_Level']="PhD"

#### find the null cols and remove them

In [7]:
df.loc[df.isnull().any(axis=1)]
df.dropna(inplace=True)

#### find the duplicate rows and remove them

In [8]:
df.loc[df.duplicated(keep=False)]
df.drop_duplicates(inplace=True)

#### shape of dataframe

In [9]:
df.shape

(1779, 6)

#### percentage of different employess with different education level

In [10]:
df.Education_Level.value_counts(normalize=True)*100

Education_Level
Bachelor's Degree   42.89
Master's Degree     31.82
PhD                 19.11
High School          6.18
Name: proportion, dtype: float64

#### Proportion of gender

In [11]:
df.Gender.value_counts(normalize=True)*100

Gender
Male     54.08
Female   45.53
Other     0.39
Name: proportion, dtype: float64

#### different job profiles

In [12]:
df.Job_Title.unique()

array(['Data Analyst', 'Director', 'FullStack Developer',
       'Marketing Coordinator', 'Senior Scientist', 'Software Developer',
       'HR Manager', 'Project Manager', 'Customer Service Rep',
       'Operations Manager', 'Marketing Manager', 'Senior Engineer',
       'Data Entry Clerk', 'Sales Director', 'VP of Operations',
       'IT Support', 'Recruiter', 'Financial Manager',
       'Social Media Specialist', 'Software Manager', 'Junior Developer',
       'Senior Consultant', 'Product Designer', 'CEO', 'Accountant',
       'Data Scientist', 'Marketing Specialist', 'Senior Manager',
       'Technical Writer', 'HR Generalist', 'Project Engineer',
       'Customer Success Rep', 'Sales Executive', 'UX Designer',
       'Operations Director', 'Network Engineer',
       'Administrative Assistant', 'Strategy Consultant', 'Copywriter',
       'Account Manager', 'Director of Marketing', 'Help Desk Analyst',
       'Customer Service Manager', 'Business Intelligence Analyst',
       'Event Coordinator', 'VP of Finance', 'Graphic Designer',
       'Sales Manager', 'UX Researcher', 'Social Media Manager',
       'Product Manager', 'Director of Operations', 'Marketing Analyst',
       'Senior Data Scientist', 'Junior Accountant',
       'Digital Marketing Manager', 'IT Manager',
       'Customer Service Representative', 'Business Development Manager',
       'Senior Financial Analyst', 'Web Developer', 'Research Director',
       'Technical Support Specialist', 'Creative Director',
       'Senior Software Engineer', 'Human Resources Director',
       'Content Marketing Manager', 'Technical Recruiter',
       'Sales Representative', 'Chief Technology Officer',
       'Junior Designer', 'Financial Advisor', 'Junior Account Manager',
       'Senior Project Manager', 'Principal Scientist', 'Sales Associate',
       'Supply Chain Manager', 'Senior Marketing Manager',
       'Business Analyst', 'Training Specialist', 'Research Scientist',
       'Junior Software Developer', 'Public Relations Manager',
       'Operations Analyst', 'Product Marketing Manager',
       'Senior HR Manager', 'Junior Web Developer',
       'Senior Project Coordinator', 'Chief Data Officer',
       'Digital Content Producer', 'IT Support Specialist',
       'Senior Marketing Analyst', 'Customer Success Manager',
       'Senior Graphic Designer', 'Software Project Manager',
       'Supply Chain Analyst', 'Senior Business Analyst',
       'Junior Marketing Analyst', 'Office Manager', 'Principal Engineer',
       'Junior HR Generalist', 'Senior Product Manager',
       'Junior Operations Analyst', 'Senior HR Generalist',
       'Sales Operations Manager', 'Senior Software Developer',
       'Junior Web Designer', 'Senior Training Specialist',
       'Senior Research Scientist', 'Junior Sales Representative',
       'Junior Marketing Manager', 'Junior Data Analyst',
       'Senior Product Marketing Manager', 'Junior Business Analyst',
       'Senior Sales Manager', 'Junior Marketing Specialist',
       'Junior Project Manager', 'Senior Accountant', 'Director of Sales',
       'Junior Recruiter', 'Senior Business Development Manager',
       'Senior Product Designer', 'Junior Customer Support Specialist',
       'Senior IT Support Specialist', 'Junior Financial Analyst',
       'Senior Operations Manager', 'Director of Human Resources',
       'Junior Software Engineer', 'Senior Sales Representative',
       'Director of Product Management', 'Junior Copywriter',
       'Senior Marketing Coordinator', 'Senior Human Resources Manager',
       'Junior Business Development Associate', 'Senior Account Manager',
       'Senior Researcher', 'Junior HR Coordinator',
       'Director of Finance', 'Junior Marketing Coordinator',
       'Junior Data Scientist', 'Senior Operations Analyst',
       'Senior Human Resources Coordinator', 'Senior UX Designer',
       'Junior Product Manager', 'Senior Marketing Specialist',
       'Senior IT Project Manager', 'Senior Quality Assurance Analyst',
       'Director of Sales and Marketing', 'Senior Account Executive',
       'Director of Business Development', 'Junior Social Media Manager',
       'Senior Human Resources Specialist', 'Senior Data Analyst',
       'Director of Human Capital', 'Junior Advertising Coordinator',
       'Junior UX Designer', 'Senior Marketing Director',
       'Senior IT Consultant', 'Senior Financial Advisor',
       'Junior Business Operations Analyst',
       'Junior Social Media Specialist',
       'Senior Product Development Manager', 'Junior Operations Manager',
       'Senior Software Architect', 'Junior Research Scientist',
       'Senior Financial Manager', 'Senior HR Specialist',
       'Senior Data Engineer', 'Junior Operations Coordinator',
       'Director of HR', 'Senior Operations Coordinator',
       'Junior Financial Advisor', 'Director of Engineering',
       'Software Engineer', 'Software Engineer Manager',
       'Back end Developer', 'Senior Project Engineer',
       'Full Stack Engineer', 'Front end Developer',
       'Front End Developer', 'Director of Data Science',
       'Human Resources Coordinator', 'Junior Sales Associate',
       'Human Resources Manager', 'Juniour HR Generalist',
       'Juniour HR Coordinator', 'Financial Analyst',
       'Digital Marketing Specialist', 'Receptionist',
       'Marketing Director', 'Social Media Man', 'Delivery Driver'],
      dtype=object)

#### count the number of seniors juniors , directors and other

In [13]:
junior=df[df.Job_Title.str.startswith('Junior')].Job_Title.count()
senior=df[df.Job_Title.str.startswith('Senior')].Job_Title.count()
director=df[df.Job_Title.str.startswith('Director')].Job_Title.count()
manager=df[df.Job_Title.str.endswith('Manager')].Job_Title.count()
data={"Junior":
     junior,
     "Senior":senior,'Director':director,'Manager':manager}
data

{'Junior': 177, 'Senior': 365, 'Director': 82, 'Manager': 472}

#### Group the data by Job Title and display their max salary

In [14]:
df.groupby('Job_Title')['Salary'].agg(Maximum_Salary=(max)).sort_values(by='Maximum_Salary',ascending=False)

                                    Maximum_Salary
Job_Title
Chief Technology Officer                 250000.00
CEO                                      250000.00
Financial Manager                        250000.00
Data Scientist                           240000.00
Marketing Manager                        228000.00
...                                            ...
Data Entry Clerk                          35000.00
Junior Business Operations Analyst        35000.00
Juniour HR Coordinator                    32000.00
Delivery Driver                           28000.00
Receptionist                              25000.00

[192 rows x 1 columns]

#### Row where the salary is maximum

In [15]:
df.sort_values(by='Salary',ascending=False)
# so financial manager has the heighest salary

,Age,Gender,Education_Level,Job_Title,Experience,Salary
5002,45.00,Male,Bachelor's Degree,Financial Manager,21.00,250000.00
84,52.00,Male,PhD,Chief Technology Officer,24.00,250000.00
31,50.00,Male,Bachelor's Degree,CEO,25.00,250000.00
4277,51.00,Male,PhD,Data Scientist,24.00,240000.00
4398,49.00,Male,Master's Degree,Marketing Manager,23.00,228000.00
...,...,...,...,...,...,...
4412,31.00,Female,High School,Junior Sales Associate,1.00,25000.00
2655,23.00,Male,PhD,Software Engineer Manager,1.00,579.00
1891,25.00,Female,Bachelor's Degree,Front end Developer,1.00,550.00
4634,31.00,Female,Bachelor's Degree,Junior HR Coordinator,4.00,500.00
260,29.00,Male,Bachelor's Degree,Junior Business Operations Analyst,1.50,350.00

#### Maximum Experience

In [16]:
df.sort_values(by='Experience',ascending=False)

,Age,Gender,Education_Level,Job_Title,Experience,Salary
2422,60.00,Female,PhD,Software Engineer Manager,34.00,188651.00
2402,57.00,Female,PhD,Software Engineer Manager,33.00,191790.00
2436,57.00,Female,Master's Degree,Full Stack Engineer,33.00,188232.00
2397,60.00,Female,PhD,Software Engineer Manager,33.00,179180.00
2821,54.00,Male,Master's Degree,Senior Software Engineer,32.00,195270.00
...,...,...,...,...,...,...
3391,22.00,Female,High School,Junior HR Generalist,0.00,40000.00
2586,23.00,Male,PhD,Software Engineer Manager,0.00,52612.00
5001,22.00,Female,High School,Sales Associate,0.00,25000.00
50,25.00,Male,Bachelor's Degree,Help Desk Analyst,0.00,35000.00
4885,21.00,Female,High School,Junior Sales Representative,0.00,25000.00

#### Mean experience of males vs female

In [17]:
df.groupby('Gender')['Experience'].agg(Mean_Experience=('mean'))
# df.query('Gender=="Other"')

        Mean_Experience
Gender
Female             8.67
Male               9.53
Other             16.43

#### From each gender display their max salary

In [18]:
df.groupby('Gender')['Salary'].agg(max)

Gender
Female   220000.00
Male     250000.00
Other    166109.00
Name: Salary, dtype: float64

#### From each Education_Level category display their max salary and Experience

In [19]:
df.groupby(['Education_Level'])[['Experience','Salary']].agg(max)

                   Experience    Salary
Education_Level
Bachelor's Degree       30.00 250000.00
High School             31.00 166109.00
Master's Degree         33.00 228000.00
PhD                     34.00 250000.00

#### How many males and females with Master's degree

In [20]:
df[ (df.Education_Level=="Master's Degree") ].Gender.value_counts()
# so 310 males and 255 female

Gender
Female    310
Male      255
Other       1
Name: count, dtype: int64

#### How many males and females with Bachlor's degree

In [21]:
df[ (df.Education_Level=="Bachelor's Degree") ].Gender.value_counts()
# so 437 males and 326
#  we can conclude that most bof females prefer choosing master degree after bachlors

Gender
Male      437
Female    326
Name: count, dtype: int64

#### Job title whose work is some how assosiated with data

In [22]:
df.loc[df.Job_Title.str.contains('Data')].Job_Title.value_counts()

Job_Title
Data Scientist              80
Data Analyst                51
Senior Data Scientist       14
Director of Data Science     7
Junior Data Analyst          3
Senior Data Analyst          3
Senior Data Engineer         2
Data Entry Clerk             1
Chief Data Officer           1
Junior Data Scientist        1
Name: count, dtype: int64

#### Different types of roles in marketing branch

In [23]:
df.loc[df.Job_Title.str.contains('Marketing')].Job_Title.value_counts()

Job_Title
Marketing Manager                   55
Director of Marketing               27
Marketing Coordinator               26
Content Marketing Manager           24
Senior Product Marketing Manager    17
Digital Marketing Manager           15
Marketing Analyst                   13
Senior Marketing Manager             8
Junior Marketing Manager             7
Marketing Director                   6
Junior Marketing Coordinator         5
Senior Marketing Analyst             4
Junior Marketing Specialist          4
Senior Marketing Coordinator         3
Senior Marketing Specialist          3
Digital Marketing Specialist         3
Junior Marketing Analyst             3
Product Marketing Manager            1
Marketing Specialist                 1
Director of Sales and Marketing      1
Senior Marketing Director            1
Name: count, dtype: int64

#### Differnt types of developers

In [24]:
df.loc[df.Job_Title.str.contains('Developer')].Job_Title.value_counts()

Job_Title
Back end Developer           81
Front end Developer          71
Web Developer                34
Software Developer           22
Junior Web Developer         15
Junior Software Developer     8
Front End Developer           4
Senior Software Developer     3
FullStack Developer           1
Junior Developer              1
Name: count, dtype: int64

#### Maximum and minimum salary of various Education_Level

In [25]:
df.groupby(['Education_Level'])['Salary'].agg(Maximum_Salary=(max),Minimum_Salary=(min))

                   Maximum_Salary  Minimum_Salary
Education_Level
Bachelor's Degree       250000.00          350.00
High School             166109.00        25000.00
Master's Degree         228000.00        32000.00
PhD                     250000.00          579.00

#### with experience of 3-5 years , display the mean salary from various education level categories

In [26]:
df.query(' 3<Experience<5').groupby('Education_Level')['Salary'].agg(Mean_Salary=('mean'))

                   Mean_Salary
Education_Level
Bachelor's Degree     76748.38
High School           65002.33
Master's Degree       85674.45
PhD                   55000.00

#### mean salary as a fresher with different educational qualification

In [27]:
df.query('Experience==0').groupby('Education_Level')['Salary'].agg(Mean_Salary=('mean'))

                   Mean_Salary
Education_Level
Bachelor's Degree     40666.00
High School           29483.20
Master's Degree       55538.00
PhD                   52695.50

#### Number of employess in various age ranges

In [28]:
bins=[20,30,40,50,60,70]
pd.cut(df.Age, bins=bins).value_counts()
# so most of the employess are between the age 30-40

Age
(30, 40]    657
(20, 30]    637
(40, 50]    402
(50, 60]     80
(60, 70]      3
Name: count, dtype: int64

#### Number 0f employess in various Experience ranges

In [29]:
data=df.Experience.unique()
np.sort(data)
bins=[0,5,12,17,22,28,35,40]
pd.cut(df.Experience,bins=bins).value_counts()
# so most the employess working in the company have experience between 0-5

Experience
(0, 5]      655
(5, 12]     601
(12, 17]    252
(17, 22]    171
(22, 28]     58
(28, 35]     22
(35, 40]      0
Name: count, dtype: int64

#### Create a pivot table with display the mean experience and salary of male and female with various educational qualification

In [30]:
df.pivot_table(index='Education_Level',columns='Gender',values=['Experience','Salary'],aggfunc='mean',fill_value="Null")

                  Experience                Salary
Gender                Female  Male Other    Female      Male     Other
Education_Level
Bachelor's Degree       6.25  6.74  Null  84982.25  96053.96      Null
High School             1.86  2.60 16.83  38380.08  43796.87 119890.00
Master's Degree         9.61 11.37 14.00 121676.54 134512.60 161393.00
PhD                    15.55 14.67  Null 159728.77 161680.93      Null